// let number = Number(prompt("enter number"));
// console.log(number);
// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }
//==================================================================================
// // Тернарный оператор
// let number = Number(prompt("enter number"));
// console.log(number);
// alert(number === 10 ? "Вірно" : "Невірно");
//===================================================================================
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// const min = Math.floor(Math.random() * 60); // Генеруємо випадкове число від 0 до 59
// console.log(min);

// let quarter;
// if (min >= 0 && min < 15) {
//   quarter = "першу";
// } else if (min >= 15 && min < 30) {
//   quarter = "другу";
// } else if (min >= 30 && min < 45) {
//   quarter = "третю";
// } else {
//   quarter = "четверту";
// }

// alert(`${min} входить в ${quarter} чверть`);

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = prompt("Введіть число від 1 до 4:");
// let result;

// switch (num) {
//   case "1":
//     result = "зима";
//     break;
//   case "2":
//     result = "весна";
//     break;
//   case "3":
//     result = "літо";
//     break;
//   case "4":
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }

// console.log(result);

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let i = 0;
// while (i <= 20) {
//   console.log(i);
//   i++;
// }
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції

function getNumbers(min, max) {
  let sumEven = 0;
  for (let i = max; i >= min; i += 1) {
    console.log(i);
    if (i % 2 === 0) {
      sumEven += i;
    }
  }
  console.log(sumEven);
}
// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.
